public/method.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />

<link rel="stylesheet" href="readtheorg.css" />
<link rel="stylesheet" href="rethink_inline.css" />
<link rel="stylesheet" href="src.css" />
</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org4791bd3"><b>Java</b></a></li>
<li><a href="#org04969b3">📚 สรุปเนื้อหาเรื่อง Methods (พร้อมตัวอย่างโค้ด)</a>
<ul>
<li><a href="#org17026a2">📌 ตัวอย่างโครงสร้าง Method พื้นฐาน</a></li>
<li><a href="#orgfb866b3">📌 ตัวอย่างการประกาศและนิยาม Method</a></li>
<li><a href="#org0321e7c">📌 การเรียกใช้งาน Method (Method Call)</a></li>
<li><a href="#orga44dc36">📌 การส่งค่าพารามิเตอร์ (Passing Parameters)</a></li>
<li><a href="#org63e5312">📌 การ Overloading Method</a></li>
<li><a href="#orgfb1efe3">📌 Method ที่เรียกตัวเอง (Recursive Method)</a>
<ul>
<li><a href="#org091a6d5">📌 Recursive Method Stopping Condition</a></li>
</ul>
</li>
<li><a href="#org115ca84">📌 การใช้งาน Method จากแพ็กเกจมาตรฐาน (API)</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org4791bd3" class="outline-2">
<h2 id="org4791bd3"><a href="./index.html"><b>Java</b></a></h2>
</div>
<div id="outline-container-org04969b3" class="outline-2">
<h2 id="org04969b3">📚 สรุปเนื้อหาเรื่อง Methods (พร้อมตัวอย่างโค้ด)</h2>
<div class="outline-text-2" id="text-org04969b3">
<p>
ความยาก: 💀💀
</p>

<p>
<b>เนื้อหาต่อจากนี้ถูกสร้างขึ้นโดย AI โดยใช้ข้อมูลจาก Presentation Slides เรื่อง Methods</b>
</p>

<hr />
</div>

<div id="outline-container-org17026a2" class="outline-3">
<h3 id="org17026a2">📌 ตัวอย่างโครงสร้าง Method พื้นฐาน</h3>
<div class="outline-text-3" id="text-org17026a2">
<div class="org-src-container">
<pre class="src src-java"><span class="org-keyword">public</span> <span class="org-keyword">class</span> <span class="org-type">MethodsExample</span> {
    <span class="org-comment-delimiter">// </span><span class="org-comment">Method &#3594;&#3639;&#3656;&#3629; add &#3619;&#3633;&#3610;&#3614;&#3634;&#3619;&#3634;&#3617;&#3636;&#3648;&#3605;&#3629;&#3619;&#3660;&#3626;&#3629;&#3591;&#3605;&#3633;&#3623;&#3649;&#3621;&#3632;&#3588;&#3639;&#3609;&#3588;&#3656;&#3634;&#3612;&#3621;&#3619;&#3623;&#3617;</span>
    <span class="org-keyword">public</span> <span class="org-keyword">static</span> <span class="org-type">int</span> <span class="org-function-name">add</span>(<span class="org-type">int</span> <span class="org-variable-name">a</span>, <span class="org-type">int</span> <span class="org-variable-name">b</span>) {
        <span class="org-keyword">return</span> a + b;
    }

    <span class="org-keyword">public</span> <span class="org-keyword">static</span> <span class="org-type">void</span> <span class="org-function-name">main</span>(<span class="org-type">String</span>[] <span class="org-variable-name">args</span>) {
        <span class="org-type">int</span> <span class="org-variable-name">result</span> = add(5, 10);
        System.out.println(<span class="org-string">"Result: "</span> + result);  <span class="org-comment-delimiter">// </span><span class="org-comment">&#3612;&#3621;&#3621;&#3633;&#3614;&#3608;&#3660;: 15</span>
    }
}
</pre>
</div>

<hr />
</div>
</div>

<div id="outline-container-orgfb866b3" class="outline-3">
<h3 id="orgfb866b3">📌 ตัวอย่างการประกาศและนิยาม Method</h3>
<div class="outline-text-3" id="text-orgfb866b3">
<div class="org-src-container">
<pre class="src src-java"><span class="org-comment-delimiter">// </span><span class="org-comment">&#3585;&#3634;&#3619;&#3611;&#3619;&#3632;&#3585;&#3634;&#3624; Method</span>
<span class="org-keyword">static</span> <span class="org-type">int</span> <span class="org-function-name">max</span>(<span class="org-type">int</span> <span class="org-variable-name">num1</span>, <span class="org-type">int</span> <span class="org-variable-name">num2</span>);

<span class="org-comment-delimiter">// </span><span class="org-comment">&#3585;&#3634;&#3619;&#3609;&#3636;&#3618;&#3634;&#3617; Method</span>
<span class="org-keyword">static</span> <span class="org-type">int</span> <span class="org-function-name">max</span>(<span class="org-type">int</span> <span class="org-variable-name">num1</span>, <span class="org-type">int</span> <span class="org-variable-name">num2</span>) {
    <span class="org-keyword">if</span> (num1 &gt; num2) {
        <span class="org-keyword">return</span> num1;
    } <span class="org-keyword">else</span> {
        <span class="org-keyword">return</span> num2;
    }
}
</pre>
</div>

<hr />
</div>
</div>

<div id="outline-container-org0321e7c" class="outline-3">
<h3 id="org0321e7c">📌 การเรียกใช้งาน Method (Method Call)</h3>
<div class="outline-text-3" id="text-org0321e7c">
<div class="org-src-container">
<pre class="src src-java"><span class="org-keyword">public</span> <span class="org-keyword">static</span> <span class="org-type">void</span> <span class="org-function-name">main</span>(<span class="org-type">String</span>[] <span class="org-variable-name">args</span>) {
    <span class="org-type">int</span> <span class="org-variable-name">i</span> = 5;
    <span class="org-type">int</span> <span class="org-variable-name">j</span> = 2;
    <span class="org-type">int</span> <span class="org-variable-name">result</span> = max(i, j);
    System.out.println(<span class="org-string">"Max value is: "</span> + result);  <span class="org-comment-delimiter">// </span><span class="org-comment">&#3612;&#3621;&#3621;&#3633;&#3614;&#3608;&#3660;: Max value is: 5</span>
}
</pre>
</div>

<hr />
</div>
</div>

<div id="outline-container-orga44dc36" class="outline-3">
<h3 id="orga44dc36">📌 การส่งค่าพารามิเตอร์ (Passing Parameters)</h3>
<div class="outline-text-3" id="text-orga44dc36">
<div class="org-src-container">
<pre class="src src-java"><span class="org-comment-delimiter">// </span><span class="org-comment">Method &#3626;&#3621;&#3633;&#3610;&#3588;&#3656;&#3634;&#3605;&#3633;&#3623;&#3649;&#3611;&#3619;&#3626;&#3629;&#3591;&#3605;&#3633;&#3623;</span>
<span class="org-keyword">static</span> <span class="org-type">void</span> <span class="org-function-name">swap</span>(<span class="org-type">int</span> <span class="org-variable-name">a</span>, <span class="org-type">int</span> <span class="org-variable-name">b</span>) {
    <span class="org-type">int</span> <span class="org-variable-name">temp</span> = a;
    a = b;
    b = temp;
    System.out.println(<span class="org-string">"Inside swap method: a = "</span> + a + <span class="org-string">", b = "</span> + b);
}

<span class="org-keyword">public</span> <span class="org-keyword">static</span> <span class="org-type">void</span> <span class="org-function-name">main</span>(<span class="org-type">String</span>[] <span class="org-variable-name">args</span>) {
    <span class="org-type">int</span> <span class="org-variable-name">m</span> = 2;
    <span class="org-type">int</span> <span class="org-variable-name">n</span> = 3;
    System.out.println(<span class="org-string">"Before swap: m = "</span> + m + <span class="org-string">", n = "</span> + n);
    swap(m, n);
    System.out.println(<span class="org-string">"After swap: m = "</span> + m + <span class="org-string">", n = "</span> + n);  <span class="org-comment-delimiter">// </span><span class="org-comment">&#3588;&#3656;&#3634;&#3652;&#3617;&#3656;&#3648;&#3611;&#3621;&#3637;&#3656;&#3618;&#3609;</span>
}
</pre>
</div>

<hr />
</div>
</div>

<div id="outline-container-org63e5312" class="outline-3">
<h3 id="org63e5312">📌 การ Overloading Method</h3>
<div class="outline-text-3" id="text-org63e5312">
<p>
ความยาก: 💀💀
</p>
<div class="org-src-container">
<pre class="src src-java"><span class="org-comment-delimiter">// </span><span class="org-comment">&#3585;&#3634;&#3619; Overloading Method &#3604;&#3657;&#3623;&#3618;&#3594;&#3639;&#3656;&#3629;&#3648;&#3604;&#3637;&#3618;&#3623;&#3585;&#3633;&#3609;&#3649;&#3605;&#3656;&#3605;&#3656;&#3634;&#3591;&#3585;&#3633;&#3609;&#3607;&#3637;&#3656;&#3594;&#3609;&#3636;&#3604;&#3614;&#3634;&#3619;&#3634;&#3617;&#3636;&#3648;&#3605;&#3629;&#3619;&#3660;</span>
<span class="org-keyword">static</span> <span class="org-type">int</span> <span class="org-function-name">max</span>(<span class="org-type">int</span> <span class="org-variable-name">num1</span>, <span class="org-type">int</span> <span class="org-variable-name">num2</span>) {
    <span class="org-keyword">return</span> (num1 &gt; num2) ? num1 : num2;
}

<span class="org-keyword">static</span> <span class="org-type">double</span> <span class="org-function-name">max</span>(<span class="org-type">double</span> <span class="org-variable-name">num1</span>, <span class="org-type">double</span> <span class="org-variable-name">num2</span>) {
    <span class="org-keyword">return</span> (num1 &gt; num2) ? num1 : num2;
}

<span class="org-keyword">public</span> <span class="org-keyword">static</span> <span class="org-type">void</span> <span class="org-function-name">main</span>(<span class="org-type">String</span>[] <span class="org-variable-name">args</span>) {
    System.out.println(max(5, 10));        <span class="org-comment-delimiter">// </span><span class="org-comment">&#3612;&#3621;&#3621;&#3633;&#3614;&#3608;&#3660;: 10</span>
    System.out.println(max(5.5, 10.1));    <span class="org-comment-delimiter">// </span><span class="org-comment">&#3612;&#3621;&#3621;&#3633;&#3614;&#3608;&#3660;: 10.1</span>
}
</pre>
</div>

<hr />
</div>
</div>

<div id="outline-container-orgfb1efe3" class="outline-3">
<h3 id="orgfb1efe3">📌 Method ที่เรียกตัวเอง (Recursive Method)</h3>
<div class="outline-text-3" id="text-orgfb1efe3">
<p>
ความยาก: 💀💀💀
</p>
<div class="org-src-container">
<pre class="src src-java"><span class="org-comment-delimiter">// </span><span class="org-comment">&#3585;&#3634;&#3619;&#3588;&#3635;&#3609;&#3623;&#3603; Factorial &#3604;&#3657;&#3623;&#3618;&#3585;&#3634;&#3619;&#3651;&#3594;&#3657; Recursive Method</span>
<span class="org-keyword">static</span> <span class="org-type">long</span> <span class="org-function-name">factorial</span>(<span class="org-type">int</span> <span class="org-variable-name">n</span>) {
    <span class="org-keyword">if</span> (n == 0) { <span class="org-comment-delimiter">// </span><span class="org-comment">&#3648;&#3591;&#3639;&#3656;&#3629;&#3609;&#3652;&#3586;&#3627;&#3618;&#3640;&#3604;</span>
        <span class="org-keyword">return</span> 1;
    } <span class="org-keyword">else</span> {
        <span class="org-keyword">return</span> n * factorial(n - 1);
    }
}

<span class="org-keyword">public</span> <span class="org-keyword">static</span> <span class="org-type">void</span> <span class="org-function-name">main</span>(<span class="org-type">String</span>[] <span class="org-variable-name">args</span>) {
    <span class="org-type">int</span> <span class="org-variable-name">number</span> = 5;
    System.out.println(<span class="org-string">"Factorial of "</span> + number + <span class="org-string">" is "</span> + factorial(number));  <span class="org-comment-delimiter">// </span><span class="org-comment">&#3612;&#3621;&#3621;&#3633;&#3614;&#3608;&#3660;: 120</span>
}
</pre>
</div>
</div>
<div id="outline-container-org091a6d5" class="outline-4">
<h4 id="org091a6d5">📌 Recursive Method Stopping Condition</h4>
<div class="outline-text-4" id="text-org091a6d5">
<p>
ถ้า Recursive Method ไม่มีเงื่อนไขหยุด จะทำให้เกิด <b>StackOverflowError</b>
</p>

<hr />
</div>
</div>
</div>

<div id="outline-container-org115ca84" class="outline-3">
<h3 id="org115ca84">📌 การใช้งาน Method จากแพ็กเกจมาตรฐาน (API)</h3>
<div class="outline-text-3" id="text-org115ca84">
<p>
ความยาก: 💀
</p>
<div class="org-src-container">
<pre class="src src-java"><span class="org-keyword">import</span> <span class="org-constant">java</span>.<span class="org-constant">util</span>.<span class="org-type">Scanner</span>;

<span class="org-keyword">public</span> <span class="org-keyword">class</span> <span class="org-type">InputExample</span> {
    <span class="org-keyword">public</span> <span class="org-keyword">static</span> <span class="org-type">void</span> <span class="org-function-name">main</span>(<span class="org-type">String</span>[] <span class="org-variable-name">args</span>) {
        <span class="org-type">Scanner</span> <span class="org-variable-name">input</span> = <span class="org-keyword">new</span> <span class="org-type">Scanner</span>(System.in);
        System.out.print(<span class="org-string">"Enter a number: "</span>);
        <span class="org-type">int</span> <span class="org-variable-name">number</span> = input.nextInt();
        System.out.println(<span class="org-string">"You entered: "</span> + number);
        input.close();
    }
}
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.6.15)</p>
</div>
</body>
</html>
